[A_Balthasar_1 H7EditorHero]
mName=""
mLore=""

[A_Euridika_11 H7EditorHero]
mName=""
mLore=""

[A_Orna_7 H7EditorHero]
mName=""
mLore=""

[A_Willehelm_1 H7EditorHero]
mName=""
mLore=""

[custom_heroes.barman H7EditorHero]
mName="酒保"
mLore=""

[custom_heroes.la_sorcière H7EditorHero]
mName="女巫"
mLore=""

[custom_heroes.Le_jeune_mage H7EditorHero]
mName="年轻法师"
mLore=""

[custom_heroes.Le_Sage H7EditorHero]
mName="贤者"
mLore=""

[custom_heroes.Odin H7EditorHero]
mName="奥丁"
mLore=""

[Prison_Reward_Armies.H7Prison_0_Reward_Army H7AdventureArmy]
mName=""

[Proetho_9 H7EditorHero]
mName="普罗埃索"
mLore=""


[TheWorld:PersistentLevel.H7DimensionChannel_0 H7DimensionChannel]
mName=""

[TheWorld:PersistentLevel.H7DimensionChannel_1 H7DimensionChannel]
mName=""

[TheWorld:PersistentLevel.H7DimensionChannel_2 H7DimensionChannel]
mName=""

[TheWorld:PersistentLevel.H7DimensionChannel_3 H7DimensionChannel]
mName=""

[TheWorld:PersistentLevel.H7DimensionChannel_4 H7DimensionChannel]
mName=""

[TheWorld:PersistentLevel.H7DimensionChannel_5 H7DimensionChannel]
mName=""

[TheWorld:PersistentLevel.H7DimensionChannel_6 H7DimensionChannel]
mName=""

[TheWorld:PersistentLevel.H7DimensionChannel_7 H7DimensionChannel]
mName=""

[TheWorld:PersistentLevel.H7DimensionChannel_8 H7DimensionChannel]
mName=""

[TheWorld:PersistentLevel.H7DimensionChannel_9 H7DimensionChannel]
mName=""

[TheWorld:PersistentLevel.H7DimensionChannelExit_0 H7DimensionChannelExit]
mName=""

[TheWorld:PersistentLevel.H7DimensionChannelExit_1 H7DimensionChannelExit]
mName=""

[TheWorld:PersistentLevel.H7DimensionChannelExit_2 H7DimensionChannelExit]
mName=""

[TheWorld:PersistentLevel.H7DimensionChannelExit_3 H7DimensionChannelExit]
mName=""

[TheWorld:PersistentLevel.H7DimensionChannelExit_4 H7DimensionChannelExit]
mName=""

[TheWorld:PersistentLevel.H7DimensionChannelExit_5 H7DimensionChannelExit]
mName=""

[TheWorld:PersistentLevel.H7DimensionChannelExit_6 H7DimensionChannelExit]
mName=""

[TheWorld:PersistentLevel.H7DimensionChannelExit_7 H7DimensionChannelExit]
mName=""

[TheWorld:PersistentLevel.H7DimensionChannelExit_8 H7DimensionChannelExit]
mName=""

[TheWorld:PersistentLevel.H7DimensionChannelExit_9 H7DimensionChannelExit]
mName=""

[TheWorld:PersistentLevel.H7DimensionPortal_0 H7DimensionPortal]
mName=""

[TheWorld:PersistentLevel.H7DimensionPortal_2 H7DimensionPortal]
mName=""

[TheWorld:PersistentLevel.H7DimensionPortal_3 H7DimensionPortal]
mName=""

[TheWorld:PersistentLevel.H7DimensionPortal_4 H7DimensionPortal]
mName=""



[TheWorld:PersistentLevel.H7Dwelling_3 H7Dwelling]
mName="精英生物住所"

[TheWorld:PersistentLevel.H7Dwelling_4 H7Dwelling]
mName="核心生物住所"



[TheWorld:PersistentLevel.H7Keymaster_0 H7Keymaster]
mName=""

[TheWorld:PersistentLevel.H7KeymasterGate_0 H7KeymasterGate]
mName=""




[TheWorld:PersistentLevel.H7Town_0 H7Town]
mName="新山谷"

[TheWorld:PersistentLevel.H7Town_1 H7Town]
mName="山谷"

[TheWorld:PersistentLevel.H7Town_10 H7Town]
mName=""

[TheWorld:PersistentLevel.H7Town_12 H7Town]
mName=""

[TheWorld:PersistentLevel.H7Town_2 H7Town]
mName="新环区"

[TheWorld:PersistentLevel.H7Town_3 H7Town]
mName="环区"

[TheWorld:PersistentLevel.H7Town_4 H7Town]
mName="新山脉"

[TheWorld:PersistentLevel.H7Town_5 H7Town]
mName="新火山口"

[TheWorld:PersistentLevel.H7Town_6 H7Town]
mName="火山口"

[TheWorld:PersistentLevel.H7Town_7 H7Town]
mName="山脉"

[TheWorld:PersistentLevel.H7Town_8 H7Town]
mName="要塞"

[TheWorld:PersistentLevel.H7Town_9 H7Town]
mName="渔村"

[TheWorld:PersistentLevel.H7VisitingShell_0 H7VisitingShell]
mDescription=""
mDescriptionInactive=""
mName="贤者"

[TheWorld:PersistentLevel.H7VisitingShell_1 H7VisitingShell]
mDescription=""
mDescriptionInactive=""
mName="雪崩4"

[TheWorld:PersistentLevel.H7VisitingShell_10 H7VisitingShell]
mDescription=""
mDescriptionInactive=""
mName="射线4"

[TheWorld:PersistentLevel.H7VisitingShell_11 H7VisitingShell]
mDescription=""
mDescriptionInactive=""
mName="半人马雕像"

[TheWorld:PersistentLevel.H7VisitingShell_12 H7VisitingShell]
mDescription=""
mDescriptionInactive=""
mName="半人马之石"

[TheWorld:PersistentLevel.H7VisitingShell_13 H7VisitingShell]
mDescription=""
mDescriptionInactive=""
mName="熔岩"

[TheWorld:PersistentLevel.H7VisitingShell_14 H7VisitingShell]
mDescription=""
mDescriptionInactive=""
mName="黄石"

[TheWorld:PersistentLevel.H7VisitingShell_15 H7VisitingShell]
mDescription=""
mDescriptionInactive=""
mName="货车"

[TheWorld:PersistentLevel.H7VisitingShell_16 H7VisitingShell]
mDescription=""
mDescriptionInactive=""
mName="奥丁之熊"

[TheWorld:PersistentLevel.H7VisitingShell_17 H7VisitingShell]
mDescription=""
mDescriptionInactive=""
mName="载具"

[TheWorld:PersistentLevel.H7VisitingShell_18 H7VisitingShell]
mDescription=""
mDescriptionInactive=""
mName="关闭的左门"

[TheWorld:PersistentLevel.H7VisitingShell_19 H7VisitingShell]
mDescription=""
mDescriptionInactive=""
mName="关闭的右门"

[TheWorld:PersistentLevel.H7VisitingShell_2 H7VisitingShell]
mDescription=""
mDescriptionInactive=""
mName="雪崩1"

[TheWorld:PersistentLevel.H7VisitingShell_20 H7VisitingShell]
mDescription=""
mDescriptionInactive=""
mName="开启的左门"

[TheWorld:PersistentLevel.H7VisitingShell_21 H7VisitingShell]
mDescription=""
mDescriptionInactive=""
mName="开启的右门"

[TheWorld:PersistentLevel.H7VisitingShell_22 H7VisitingShell]
mDescription=""
mDescriptionInactive=""
mName="阿丽西亚雕像"

[TheWorld:PersistentLevel.H7VisitingShell_23 H7VisitingShell]
mDescription=""
mDescriptionInactive=""
mName="年轻法师之家"

[TheWorld:PersistentLevel.H7VisitingShell_24 H7VisitingShell]
mDescription=""
mDescriptionInactive=""
mName="酒吧"

[TheWorld:PersistentLevel.H7VisitingShell_25 H7VisitingShell]
mDescription=""
mDescriptionInactive=""
mName="女巫"

[TheWorld:PersistentLevel.H7VisitingShell_26 H7VisitingShell]
mDescription=""
mDescriptionInactive=""
mName="空 garrison"

[TheWorld:PersistentLevel.H7VisitingShell_3 H7VisitingShell]
mDescription=""
mDescriptionInactive=""
mName="射线1"

[TheWorld:PersistentLevel.H7VisitingShell_4 H7VisitingShell]
mDescription=""
mDescriptionInactive=""
mName="奥丁之石"

[TheWorld:PersistentLevel.H7VisitingShell_5 H7VisitingShell]
mDescription=""
mDescriptionInactive=""
mName="雪崩2"

[TheWorld:PersistentLevel.H7VisitingShell_6 H7VisitingShell]
mDescription=""
mDescriptionInactive=""
mName="射线2"

[TheWorld:PersistentLevel.H7VisitingShell_7 H7VisitingShell]
mDescription=""
mDescriptionInactive=""
mName="雪崩3"

[TheWorld:PersistentLevel.H7VisitingShell_8 H7VisitingShell]
mDescription=""
mDescriptionInactive=""
mName="射线3"

[TheWorld:PersistentLevel.H7VisitingShell_9 H7VisitingShell]
mDescription=""
mDescriptionInactive=""
mName="高塔"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_0 H7SeqAct_Quest_NewNode]
mTitle="H7SeqAct_Quest_NewNode_0"
mDescription=""
mRewardText=""

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_1 H7SeqAct_Quest_NewNode]
mTitle="H7SeqAct_Quest_NewNode_1"
mDescription=""
mRewardText=""

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_10 H7SeqAct_Quest_NewNode]
mTitle="占领生物住所"
mDescription="占领生物住所"
mRewardText=""

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_11 H7SeqAct_Quest_NewNode]
mTitle="拜访阿尔卡斯祭坛"
mDescription="拜访阿尔卡斯祭坛"
mRewardText=""

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_12 H7SeqAct_Quest_NewNode]
mTitle="占领新山谷"
mDescription="占领新山谷村庄"
mRewardText=""

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_13 H7SeqAct_Quest_NewNode]
mTitle="拜访高塔"
mDescription="拜访高塔"
mRewardText=""

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_14 H7SeqAct_Quest_NewNode]
mTitle="收集5000灵魂"
mDescription="杀死5000名敌人"
mRewardText="你是个刺客"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_15 H7SeqAct_Quest_NewNode]
mTitle="建设山谷"
mDescription="山谷达到15级"
mRewardText="你是个建设者"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_16 H7SeqAct_Quest_NewNode]
mTitle="建设环区"
mDescription="环区达到15级"
mRewardText="你是个伟大的建设者"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_17 H7SeqAct_Quest_NewNode]
mTitle="建设火山口"
mDescription="火山口达到15级"
mRewardText="你是个非常伟大的建设者"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_18 H7SeqAct_Quest_NewNode]
mTitle="建设山脉"
mDescription="山脉达到15级"
mRewardText="你是个非凡的建设者"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_19 H7SeqAct_Quest_NewNode]
mTitle="头晕的年轻法师"
mDescription="找到年轻法师丢失的物品"
mRewardText=""

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_2 H7SeqAct_Quest_NewNode]
mTitle="收集500灵魂"
mDescription="杀死500名敌人"
mRewardText="你是个杀手"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_3 H7SeqAct_Quest_NewNode]
mTitle="两个村庄"
mDescription="占领两个村庄"
mRewardText="恭喜，这些新盟友对你将大有帮助！"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_4 H7SeqAct_Quest_NewNode]
mTitle="半人马"
mDescription="帮助半人马"
mRewardText="你救了我们，你将永远是半人马的朋友约兰！"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_5 H7SeqAct_Quest_NewNode]
mTitle="元素"
mDescription="找到并击败冰龙"
mRewardText="你真是个战士！"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_6 H7SeqAct_Quest_NewNode]
mTitle="僧侣之岛"
mDescription="找到前往僧侣岛的方法"
mRewardText="多么好的法术！"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_7 H7SeqAct_Quest_NewNode]
mTitle="要塞"
mDescription="占领巴尔萨泽的城堡"
mRewardText="巴尔萨泽死了！"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_8 H7SeqAct_Quest_NewNode]
mTitle="解救阿丽西亚"
mDescription="解救阿丽西亚"
mRewardText=""

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_9 H7SeqAct_Quest_NewNode]
mTitle="拜访贤者"
mDescription="拜访贤者"
mRewardText=""

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestGroup_0 H7SeqAct_QuestGroup]
mTitle="贤者"
mDescription="贤者给予好的建议"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestGroup_1 H7SeqAct_QuestGroup]
mTitle="杀手"
mDescription=""

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_0 H7SeqAct_QuestObjective]
mDescription="击败所有对手。如果你连续7天没有控制城镇或失去所有英雄和城镇，你将被击败。"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_1 H7SeqAct_QuestObjective]
mDescription=""

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_10 H7SeqAct_QuestObjective]
mDescription="占领火山口"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_11 H7SeqAct_QuestObjective]
mDescription="在21天内占领山脉"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_12 H7SeqAct_QuestObjective]
mDescription="与冰龙战斗"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_13 H7SeqAct_QuestObjective]
mDescription="占领渔村"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_14 H7SeqAct_QuestObjective]
mDescription="占领要塞"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_15 H7SeqAct_QuestObjective]
mDescription="解救阿丽西亚"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_16 H7SeqAct_QuestObjective]
mDescription="拜访贤者"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_17 H7SeqAct_QuestObjective]
mDescription="占领核心生物住所"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_18 H7SeqAct_QuestObjective]
mDescription="占领精英生物住所"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_19 H7SeqAct_QuestObjective]
mDescription="拜访阿尔卡斯祭坛"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_2 H7SeqAct_QuestObjective]
mDescription="击败所有对手。如果你连续7天没有控制城镇或失去所有英雄和城镇，你将被击败。"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_20 H7SeqAct_QuestObjective]
mDescription="占领新山谷村庄"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_21 H7SeqAct_QuestObjective]
mDescription="拜访高塔"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_22 H7SeqAct_QuestObjective]
mDescription="山脉达到15级"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_23 H7SeqAct_QuestObjective]
mDescription="找到年轻法师丢失的物品"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_3 H7SeqAct_QuestObjective]
mDescription=""

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_4 H7SeqAct_QuestObjective]
mDescription="杀死500名敌人"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_5 H7SeqAct_QuestObjective]
mDescription="杀死5000名敌人"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_6 H7SeqAct_QuestObjective]
mDescription="山谷达到15级"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_7 H7SeqAct_QuestObjective]
mDescription="环区达到15级"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_8 H7SeqAct_QuestObjective]
mDescription="火山口达到15级"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_9 H7SeqAct_QuestObjective]
mDescription="占领环区"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_3.H7SeqAct_ShowDialogue_0 H7SeqAct_ShowDialogue]
mLines[0]_Content="干得好！\n你已走上正轨，很快就能拜访阿尔卡斯的祭坛了。"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_3.H7SeqAct_ShowDialogue_1 H7SeqAct_ShowDialogue]
mLines[0]_Content="山谷村庄已被占领并重建！"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_3.H7SeqAct_ShowDialogue_10 H7SeqAct_ShowDialogue]
mLines[0]_Content="欢迎，约兰。你的英勇事迹已经传到我们这里。"
mLines[1]_Content="他们只是野蛮人。"
mLines[2]_Content="当然……我们有一个任务交给你，你将面对重重困难！"
mLines[3]_Content="是什么任务？"
mLines[4]_Content="一小群冰龙威胁我们太久了。"
mLines[5]_Content="你确定在跟合适的人说话吗？我为什么要与潜在的盟友战斗？" 
mLines[6]_Content="因为这些龙不尊重任何事物和任何人。它们已经疯了。\r\n如果你能消灭它们，我们将给你我们人民最珍贵的宝藏：烈焰手套，这在你对抗圣堂仆从的战斗中会非常有用。"
mLines[7]_Content="听起来很公平。\r\n我该去哪里？"
mLines[8]_Content="沿着谢尔格大门外的山谷前进。我们刚刚为你打开了一条通道。\r\n但一定要带上非常强大的军队，包括霜鸟。\r\n我们不是那么着急，慢慢来。"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_3.H7SeqAct_ShowDialogue_11 H7SeqAct_ShowDialogue]
mLines[0]_Content="干得好，约兰，我就知道我们可以指望你。作为奖励，收下这对烈焰手套，它将帮助你击败人类入侵者。"
mLines[1]_Content="谢谢。现在我需要去找奥丁。你能帮我吗？"
mLines[2]_Content="当然，沿着你在山谷底部看到的那个传送门走。我们还会为你打开一个单向传送门，让你的部队能够在巴尔萨泽要塞附近与你会合。"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_3.H7SeqAct_ShowDialogue_12 H7SeqAct_ShowDialogue]
mLines[0]_Content="你在这里做什么，约兰，托尔格之子？"
mLines[1]_Content="我恭敬地问候您，阿斯加德的神奥丁。我的母亲阿丽西亚被入侵者囚禁了，他们想把神赶出阿斯加德，建立新的宗教。"
mLines[2]_Content="我听说过这些微不足道的人物。但你是托尔格的儿子，一个在阿斯加德很有名的人。所以我会给你一个证明自己价值的机会。"
mLines[3]_Content="找回这些人在我儿子巴德尔的遗骸处偷走的德罗普尼尔王冠。然后集结部队与这些人类入侵者战斗。"
mLines[4]_Content="为此，走那条将带你到被遗忘山谷的通道，人类在那里建立了据点，去拜访贤者。\r\n别忘了回来！"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_3.H7SeqAct_ShowDialogue_13 H7SeqAct_ShowDialogue]
mLines[0]_Content="谁敢打扰我？"
mLines[1]_Content="奥丁，阿斯加德的众神之神，我是约兰，托尔格之子。"
mLines[2]_Content="托尔格的儿子？这很有趣。来阿斯加德吧，约兰，托尔格之子，我会为你打开一条通道。"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_3.H7SeqAct_ShowDialogue_14 H7SeqAct_ShowDialogue]
mLines[0]_Content="好吧，约兰，托尔格之子，我看到你已经完成了一些功绩。\r\n所以我要帮助你，让你找到你的妹妹卢芙。"
mLines[1]_Content="沿着这条通道走，它会带你找到你的妹妹卢芙。"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_3.H7SeqAct_ShowDialogue_15 H7SeqAct_ShowDialogue]
mLines[0]_Content="你好，妹妹。你怎么样？"
mLines[1]_Content="你好约兰。妈妈被那个可恶的巴尔萨泽囚禁了！你是来帮我解救她的吗？"
mLines[2]_Content="我招募了一支军队就是为了这个！"
mLines[3]_Content="不幸的是，情况并不简单……爸爸囚禁了我的狼伙伴，拒绝释放它们。"
mLines[4]_Content="但为什么？"
mLines[5]_Content="因为如果他这样做，巴尔萨泽发誓要杀死妈妈！"
mLines[6]_Content="所以我们必须杀死巴尔萨泽！"
mLines[7]_Content="你打算怎么做？他受到一个无法穿透的屏障保护！" 
mLines[8]_Content="我要去见托尔格，我们的父亲。我们会找到解决办法的！"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_3.H7SeqAct_ShowDialogue_16 H7SeqAct_ShowDialogue]
mLines[0]_Content="约兰，我的儿子，你还活着，感谢奥丁！"
mLines[1]_Content="爸爸！见到你我太高兴了。我刚见过卢芙。"
mLines[2]_Content="情况不简单，约兰。巴尔萨泽，入侵军的指挥官，挟持了你的母亲阿丽西亚作为人质。如果我试图解救阿丽西亚，他会杀了她。如果我释放狼群让你妹妹卢芙尝试解救母亲，巴尔萨泽也会杀死阿丽西亚。"
mLines[3]_Content="但我可以和他战斗！"
mLines[4]_Content="但你的军队规模不足以攻击保护巴尔萨泽城堡的堡垒！" 
mLines[5]_Content="难道没有其他方法接近这个野蛮人吗？"
mLines[6]_Content="我听说有一个岛，僧侣之岛，只能从海上到达，从那里有办法到达巴尔萨泽的城堡，因为每周都有僧侣援军从那个岛过来。"
mLines[7]_Content="所以我们要做的就是到达僧侣之岛，然后攻击巴尔萨泽的城堡！我看到那边的渔村不是吗？"
mLines[8]_Content="唉，巴尔萨泽烧毁了所有的船只！"
mLines[9]_Content="我要去，我会找到办法的，即使必须游泳！"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_3.H7SeqAct_ShowDialogue_17 H7SeqAct_ShowDialogue]
mLines[0]_Content="好样的约兰，你走对路了。\r\n多亏了你的勇敢，你将能够进入位于渔村不远处的奥术圣地。\r\n从而找到前往僧侣之岛的方法。"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_3.H7SeqAct_ShowDialogue_18 H7SeqAct_ShowDialogue]
mLines[0]_Content="这怎么可能？你击败了我，光明冠军！\r\n但你到底是谁，年轻的魔法师？"
mLines[1]_Content="我是约兰，托尔格和阿丽西亚的儿子，卢芙的哥哥。"
mLines[2]_Content="一个简单的孩子！"
mLines[3]_Content="一个你剥夺了他母亲的孩子！\r\n巴尔萨泽，你真可耻！\r\n奥丁不能让这种罪行不受惩罚！"
mLines[4]_Content="奥丁是什么意思？但旧神并不存在！只有光明存在！"
mLines[5]_Content="巴尔萨泽，你让我发笑！所以我遇见了一个不存在的神？他还委托我寻找我现在戴着的德罗普尼尔王冠，这也是不存在的？\r\n凝视德罗普尼尔王冠吧，巴尔萨泽！\r\n相反，你完全无法向我展示任何证据证明你的神真的存在！"
mLines[6]_Content="你这个无礼的年轻人！"
mLines[7]_Content="你输了，巴尔萨泽，还有你那不存在的神！\r\n看，你堡垒的驻军在你失败后逃跑了！"
mLines[8]_Content="现在我要去解救我的母亲，然后回去见我的神奥丁。"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_3.H7SeqAct_ShowDialogue_19 H7SeqAct_ShowDialogue]
mLines[0]_Content="哦约兰，我的儿子，你来解救我了！"
mLines[1]_Content="妈妈！\r\n终于又见到你，我太高兴了！"
mLines[2]_Content="约兰，我无法想象你经历了多少危险才来到这里。"
mLines[3]_Content="为了你，妈妈，我本可以去阿斯加德请求觐见奥丁……"
mLines[4]_Content="哦，约兰，别告诉我……"
mLines[5]_Content="不，妈妈，我什么也不会说。\r\n最重要的是我们团聚了！\r\n但我还有一顶小皇冠要归还给它的主人……"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_3.H7SeqAct_ShowDialogue_2 H7SeqAct_ShowDialogue]
mLines[0]_Content="环区村庄已被占领并重建！"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_3.H7SeqAct_ShowDialogue_20 H7SeqAct_ShowDialogue]
mLines[0]_Content="所以你成功了，约兰，托尔格之子。你确实是你父亲的儿子，如此无畏，如此高效，如此疯狂地投身于这样的任务。"
mLines[1]_Content="哦伟大的奥丁，我别无选择。我全家人的命运都取决于我。"
mLines[2]_Content="听起来像是你在听你父亲说话！一个人在行动中总是有选择的。但你，约兰，已经证明你是一个伟大的人，一个可以信赖的人，一个从不抛弃他所爱的人。"
mLines[3]_Content="因此，约兰，我感谢你找回了德罗普尼尔王冠，并且将来我会知道，你是一个可以托付重要任务的人。\r\n平安去吧，约兰·托尔格松。"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_3.H7SeqAct_ShowDialogue_21 H7SeqAct_ShowDialogue]
mLines[0]_Content="非常好，约兰。现在你必须拜访阿尔卡斯的封印。"
mLines[1]_Content="我会去的。"
mLines[2]_Content="完成后回来。"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_3.H7SeqAct_ShowDialogue_22 H7SeqAct_ShowDialogue]
mLines[0]_Content="太棒了，约兰。\r\n现在你必须占领山谷村庄。"
mLines[1]_Content="这个村庄就在阿尔卡斯封印的那边。"
mLines[2]_Content="完成后回来找我。"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_3.H7SeqAct_ShowDialogue_23 H7SeqAct_ShowDialogue]
mLines[0]_Content="干得好约兰，你已经把山谷村庄变成了一个小镇。\r\n这对你的未来会有用。\r\n你必须继续努力以吸引更强大的生物。"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_3.H7SeqAct_ShowDialogue_24 H7SeqAct_ShowDialogue]
mLines[0]_Content="太棒了，约兰。随着新城市的发展，你的力量也在增长。\r\n继续建设以进一步增强你的力量。"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_3.H7SeqAct_ShowDialogue_25 H7SeqAct_ShowDialogue]
mLines[0]_Content="这更增强了你的力量，约兰。\r\n不要停止建设！"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_3.H7SeqAct_ShowDialogue_26 H7SeqAct_ShowDialogue]
mLines[0]_Content="哦，你好。抱歉这么无礼，但我在找我弄丢的两件物品。我的戒指和斗篷。没有它们，我将无法返回魔法学院。"
mLines[1]_Content="需要我帮你找吗？"
mLines[2]_Content="那就太感谢了！如果你找到了，我可以把这件漂亮的天鹅绒斗篷给你。"
mLines[3]_Content="你知道你可能把它们落在哪里了吗？"
mLines[4]_Content="不知道，我脑子里一团糟（今天早上头很痛）。我只记得昨晚和朋友去酒吧庆祝魔法考试结束了。"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_3.H7SeqAct_ShowDialogue_27 H7SeqAct_ShowDialogue]
mLines[0]_Content="哦，你找到了我丢失的物品！非常感谢，我现在可以回魔法学院了。"
mLines[1]_Content="这是应该的，魔法师应该互相帮助。"
mLines[2]_Content="按约定，请收下这件漂亮的天鹅绒斗篷作为奖励。"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_3.H7SeqAct_ShowDialogue_28 H7SeqAct_ShowDialogue]
mLines[0]_Content="你好。\r\n我的一个朋友，一位年轻法师，丢了他的戒指。"
mLines[1]_Content="是的，当然，我昨晚找到了。\r\n必须说你朋友当时的状态连自己走两步都不行！"
mLines[2]_Content="确实，今天早上他看起来不太好，还头疼……"
mLines[3]_Content="是的，就是这样！\r\n这是他的戒指。"
mLines[4]_Content="非常感谢！\r\n你知道他接下来去哪儿了吗？"
mLines[5]_Content="哦，他没去哪儿！是他的朋友们把他拖出去的。\r\n如果他们去找女巫寻求解药，我一点也不会奇怪……"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_3.H7SeqAct_ShowDialogue_29 H7SeqAct_ShowDialogue]
mLines[0]_Content="你好\r\n你在找什么？"
mLines[1]_Content="是我的一个朋友，一位年轻法师，在找他的斗篷。"
mLines[2]_Content="啊，那个家伙，他昨晚状态糟透了！他自己站都站不稳！\r\n他在这里搞得一团糟！幸运的是，他的法师学徒朋友在离开前把一切都打扫干净了。"
mLines[3]_Content="我们得试着原谅他；他只是在庆祝魔法考试结束……"
mLines[4]_Content="无论他可怜状态的原因是什么，这不关我的事。我从不拒绝帮助需要帮助的人。"
mLines[5]_Content="那这件斗篷呢？"
mLines[6]_Content="啊，是的，当然！\r\n他的朋友们到达时把它放在这把椅子上，离开时忘了拿。\r\n必须说他们要扛一个大包袱！\r\n拿着他的斗篷，带回去给他吧！"
mLines[7]_Content="非常感谢，我这就回去把斗篷带给年轻法师。"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_3.H7SeqAct_ShowDialogue_3 H7SeqAct_ShowDialogue]
mLines[0]_Content="火山口村庄已被占领并重建！"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_3.H7SeqAct_ShowDialogue_30 H7SeqAct_ShowDialogue]
mLines[0]_Content="这个场景基于让·范哈姆和格雷戈尔·罗斯林斯基创作的《托尔格》漫画中的人物托尔格、阿丽西亚、约兰和卢芙。\r\n不过，情节是原创的。不妨读读这个绝对非凡的漫画系列！"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_3.H7SeqAct_ShowDialogue_31 H7SeqAct_ShowDialogue]
mLines[0]_Content="阿丽西亚监狱的大门打开了！"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_3.H7SeqAct_ShowDialogue_32 H7SeqAct_ShowDialogue]
mLines[0]_Content="你听到第一间屋子里传来噪音，好像有人在拼命寻找什么……"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_3.H7SeqAct_ShowDialogue_33 H7SeqAct_ShowDialogue]
mLines[0]_Content="三周过去了，山脉村庄未被占领。半人马被入侵了，圣堂的征服者赢得了战争……"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_3.H7SeqAct_ShowDialogue_4 H7SeqAct_ShowDialogue]
mLines[0]_Content="山脉村庄已被占领并重建！"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_3.H7SeqAct_ShowDialogue_5 H7SeqAct_ShowDialogue]
mLines[0]_Content="你好约兰。我们得知你正在领导一场对抗圣堂入侵者的战斗。"
mLines[1]_Content="确实，这些野蛮人入侵了我的村庄，杀了许多人，还囚禁了我的母亲。"
mLines[2]_Content="我们也面临着这些杀手。我们的间谍了解到这些人类正在集结一支军队来入侵我们。"
mLines[3]_Content="既然我们有共同的目标，我们提议结盟。如果你成功征服了人类的村庄，我们将用传奇的半人马弓奖励你。"
mLines[4]_Content="这看起来是个公平的交易。是哪个村庄？"
mLines[5]_Content="是山脉村庄。它位于这个山谷的尽头。"
mLines[6]_Content="快点，约兰，不要浪费时间，因为那些人类很快就会来攻击我们。\r\n你有三周时间成功。"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_3.H7SeqAct_ShowDialogue_6 H7SeqAct_ShowDialogue]
mLines[0]_Content="你好约兰。\r\n要找回德罗普尼尔王冠，你必须先夺回山谷村庄。而要做到这一点，你需要部队！"
mLines[1]_Content="很好。那我就占领我在附近看到的那些生物住所。"
mLines[2]_Content="完成后回来。"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_3.H7SeqAct_ShowDialogue_7 H7SeqAct_ShowDialogue]
mLines[0]_Content="太好了，约兰。现在你可以去熔岩环绕的高塔取德罗普尼尔王冠了。"
mLines[1]_Content="我马上就去。"
mLines[2]_Content="当你找回德罗普尼尔王冠后，挡住通往另外两个村庄道路的岩石就会瓦解。"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_3.H7SeqAct_ShowDialogue_8 H7SeqAct_ShowDialogue]
mLines[0]_Content="你现在拥有了德罗普尼尔王冠。\r\n奥丁之石已经破碎！"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_3.H7SeqAct_ShowDialogue_9 H7SeqAct_ShowDialogue]
mLines[0]_Content="摆脱这个威胁真是天大的喜事，约兰！\r\n为了感谢你，我们为你打开一条通道，让你能带来援军。"
mLines[1]_Content="但是……为什么你们不早点这么做？"
mLines[2]_Content="因为你永远不能太小心！\r\n打开这个通道可能会让圣堂人很快入侵我们……而且我们中的许多人都怀疑你能否击败这些野蛮人！"
mLines[3]_Content="我们还移走了我们放在山脉村庄附近霜族家园前的巨石。\r\n这样，你就可以招募新的盟友了！"
mLines[4]_Content="但你是一位伟大的战士！\r\n那么你或许可以帮助火元素摆脱一个……令人不寒而栗的敌人！\r\n祝你好运，约兰，托尔格之子。"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_3.H7SeqAct_ShowText_0 H7SeqAct_ShowText]
mText="人类已经在北部登陆，以推行他们的新宗教。\r\n约兰的村庄遭到袭击。约兰得以逃脱，但他的母亲阿丽西亚被俘。"

[TheWorld:PersistentLevel.WorldInfo_0.H7MapInfo_0 H7MapInfo]
mName="阿斯加德"
mDescription="重要提示：玩家1必须选择塔楼作为其阵营，玩家2（AI）必须选择圣堂。\r\n僧侣已经入侵了北方维京人的土地。\n他们所到之处，唯有毁灭与死亡。\r\n约兰设法逃脱了，但他的母亲阿丽西亚被俘虏了。\r\n使用MMH7.5版本1.38.3或更高版本进行游戏。\r\n感谢@Doctor的技术支持。"

[Town_Garrison.H7Garrison_0_Garrison H7AdventureArmy]
mName=""

[Town_Garrison.H7Town_0_Garrison H7AdventureArmy]
mName=""

[Town_Garrison.H7Town_1_Garrison H7AdventureArmy]
mName=""

[Town_Garrison.H7Town_2_Garrison H7AdventureArmy]
mName=""

[Town_Garrison.H7Town_3_Garrison H7AdventureArmy]
mName=""

[Town_Garrison.H7Town_4_Garrison H7AdventureArmy]
mName=""

[Town_Garrison.H7Town_5_Garrison H7AdventureArmy]
mName=""

[Town_Garrison.H7Town_6_Garrison H7AdventureArmy]
mName=""

[Town_Garrison.H7Town_7_Garrison H7AdventureArmy]
mName=""

[Town_Garrison.H7Town_8_Garrison H7AdventureArmy]
mName=""

[Town_Garrison.H7Town_9_Garrison H7AdventureArmy]
mName=""